<template>
    <section>
       <div class="box">
           <h2 class="blackTitle">暹罗点餐用户服务协议</h2>
           <p class="blackText">本网站的各项服务的所有权和运作权归暹罗点餐。本网站仅提供餐饮服务信息发布及其他与此相关联之服务。商家（或称“使用者”）必须完全同意包括本协议在内的所有服务条款（包括但不限于《用户协议》、《隐私政策》、《法律声明》），才能注册成为本网站的使用者，并遵守本协议所述之条款使用本网站所提供的服务，在注册成为商家的同时，您也承认了您拥有购买本网站所提供的服务产品所必须的完全民事权利能力和行为能力，并且您将对您在订单中提供的所有信息的真实性、准确性、合法性和完整性负责。如果您不接受本协议之条款，请勿使用本网站。如您注册，则视为您已经接受本协议之内容。</p>
           <p class="blackText">本网站保留随时修正本服务条款的权利。如果我们决定改变本网站的商家服务协议，我们会在本网站公布改变的内容。除非用户向本网站提出不接受修改并立即终止服务的通知，否则本网站视为用户接受修改后的内容并按照修改后的内容继续享有本网站提供的服务。或者您虽然向本网站提出异议但仍继续使用本网站提供之服务的，则视为您已经同意本网站就用户协议的修改并愿意遵照执行。本网站对上述修改所致的用户的任何不便或损失（如有）不承担任何责任。</p>
            <h2 class="blackTitle">一、服务声明</h2>

            <h3 class="littleTitle">（一）上网的准备</h3>
            <p class="blackLittleText">本网站运用自己的操作系统通过国际互联网络为用户提供网络服务。同时，商家必须：</p>
            <p class="blackLittleText">1、自行配备上网的所需设备，包括个人电脑、调制解调器或其他必备上网装置。</p>
            <p class="blackLittleText">2、自行负担上网所支付的与此服务有关的电话费用、网络费用。</p>

            <h3 class="littleTitle">（二）信息的发布</h3>
            <p class="blackLittleText">本网站只能用于餐饮服务相关的合法目的，商家在成功注册为商家后，仅可就餐饮服务目的在本网站发布餐饮服务信息以及按照本网站为您开设的权限。本网站明确禁止将本网站及从本网站获取的信息用于任何其他非餐饮服务相关的用途，并要求所有商家同意不得使用本网站从事下列任何一种行为：</p>
            <p class="blackLittleText">1、发布任何有关法律法规明令禁止发布的信息；</p>
            <p class="blackLittleText">2、发布任何与、餐饮服务信息发布之目的不适之信息；</p>
            <p class="blackLittleText">3、发布任何职位名称与职位描述不符的信息；</p>
            <p class="blackLittleText">4、以任何形式侵犯他人的版权、商标权、商业秘密或其他知识产权；</p>
            <p class="blackLittleText">5、侵犯个人和社会大众的隐私安全；</p>
            <p class="blackLittleText">6、传输违反任何法律法规及其他规范性文件的信息，包括但不限于属于任何非法的、骚扰性的、中伤性的、辱骂性的、恐吓性的、伤害性、庸俗或淫秽的信息。</p>
            <p class="blackLittleText">7、发布虚假、不准确、不完整或具有误导性的职位信息或意见、通知、商业广告或其他与餐饮服务目的不符的内容。</p>
            <p class="blackLittleText">8、发布任何违反法律法规及其他规范性文件、具有贬损、侮辱、有违社会公序良俗等的信息或言论；</p>
            <p class="blackLittleText">9、利用网站开设的功能或权限发布、编辑、传播等违反法律法规及其他规范性文件、引人反感或有违风化的信息、言论或内容。</p>
            <p class="blackLittleText">为了证明商家主体资格的真实性，商家应当向本网站提供相关证明材料（包括但不限于加盖公章的营业执照副本等），商家向本网站不可撤销的承诺其系依法成立的法人、团体或其他法律认可的组织。商家保证其向本网站提供的上述证明材料及在本网站发布的信息真实、合法、有效，且对该企业及企业在本网站所发布的信息及借助本网站所实施的全部行为承担完全责任，如因商家自身或商家所发布的信息违反本协议之规定或者侵犯任何第三方的合法权益引起的一切纠纷或责任，由商家自行承担，本网站不承担任何责任且有权向商家进行追偿。</p>

            <h3 class="littleTitle">（三）信息的使用</h3>
            <p class="blackLittleText">1、本网站提供的其他信息，仅能用于同该信息之相应内容有关的目的，否则，不得作为其他目的使用。本网站享有解释信息使用之目的的权利；</p>
            <p class="blackLittleText">2、本网站信息仅用于满足商家自身餐饮服务之目的，商家不得将任何本网站的信息用作任何商业目的，也不得未经本网站之许可，向任何其他第三方披露、许可、转让本网站非公开信息或以类似前述之方式使其他第三方所知晓相关信息。</p>
            <p class="blackLittleText">3、商家不得将从暹罗点餐所购买的服务产品用于任何除自身餐饮服务以外的其他目的，或以任何方式泄露、授权或变相授权给任何第三方，除非事先获得暹罗点餐的同意。</p>
         
            <h3 class="littleTitle">（四）信息的公开</h3>
            <p class="blackLittleText">在本网站所发布的任何信息，均有可能被任何本网站的访问者浏览，也可能被错误使用。本网站对前述浏览或错误使用情形将不予承担任何责任。</p>
          
            <h3 class="littleTitle">（五）信息的更改与删除</h3>
            <p class="blackLittleText">除了信息的发布者外，任何访问者不得更改或删除他人发布的任何信息。本网站有权根据判断按照法律法规及其他规范性文件的要求修改或删除任何本网站认为不适合通过本网站发布信息。</p>
            
            <h3 class="littleTitle">（六）帐号、密码及安全性</h3>
            <p class="blackLittleText">商家一旦注册成功，成为本网站的商家，将得到一个密码和用户名。商家可随时改变密码，并负责用户名与密码的安全。商家不得将该用户名及密码提供给第三方使用或从事任何可能使用户名、密码存在泄露危险的行为（包括但不限于授权代理登录获取暹罗点餐信息、资料或利用第三方客户端插件及其他不正当手段获取暹罗点餐信息、资料的）。商家不得通过自研或授权、默认其他任何第三方利用各种计算机程序或其他任何方式对暹罗点餐网站、手机APP、数据库信息等进行任何非正常访问或上述资料的获取、下载等。</p>
            <p class="blackLittleText">商家对以其用户名进行的所有活动和事件负全责。若商家发现任何非法使用用户帐号或存在安全漏洞的情况，请立即通告本网站。商家应理解并知悉暹罗点餐餐饮服务采取行动需要合理时间，暹罗点餐餐饮服务对在采取行动前已经产生的后果（包括但不限于商家的任何损失）不承担任何责任。</p>

             <h3 class="littleTitle">（七）餐饮服务的合法性</h3>
            <p class="blackLittleText">1、商家应保证其所发布或提供信息的真实性、合法性、有效性，不得冒充他人、不得利用他人的名义发布任何信息。</p>
            <p class="blackLittleText">2、商家应保证其餐饮服务行为的合法性，保证不存在任何扣押被录用人员或参加面试人员的居民身份证和其他证件、以担保或其他任何名义向劳动者收取财物或其他以招用人员为名牟取不正当利益等民事或刑事等违法、犯罪行为。若因其餐饮服务行为引发任何第三人投诉或诉讼等情形，应主动采取补救措施、并积极配合暹罗点餐降低和消除事件可能给暹罗点餐造成的影响。</p>
            <p class="blackLittleText">3、商家应保证遵守餐饮服务活动秩序，合理使用暹罗点餐提供的物料及资源，因商家及其工作人员原因造成暹罗点餐或其他人身或财产损失的，均由商家负责全额赔偿。</p>

             <h3 class="littleTitle">(八)网站使用</h3>
            <p class="blackLittleText">1、明确的禁止使用</p>
            <p class="blackLittleText">暹罗点餐（含网站及手机APP）只能用于餐饮服务相关的合法目的，即个人职业和。暹罗点餐明确禁止任何其他非餐饮服务相关的用途，并要求所有使用者同意不用于使用暹罗点餐开展下列任何一种用途：</p>
            <p class="blackLittleText">（1）公布不是餐饮服务信息的资料，如意见、通知、商业广告或其他非餐饮服务内容；</p>
            <p class="blackLittleText">（2）除发布者外，删除或修改其他个人或公司公布的资料；</p>
            <p class="blackLittleText">（3）擅自打印、复制或以其他方式使用有关的任何个人资料或有关的商业信息；</p>
            <p class="blackLittleText">（4）未经同意，给公布信息的个人或公司发电子邮件、打电话、寄信或以其他方式进行接触。</p>
            <p class="blackLittleText">2、网址安全法规</p>
            <p class="blackLittleText">禁止使用者违反安全法规，破坏或企图破坏网站的安全法规保护措施，包括但不限于：</p>
            <p class="blackLittleText">（1）接触未经许可的数据或进入未经许可的服务器、帐户、邮箱或许可第三方接入未经本网站同意的由本网站发布、输送、传播的数据或其他信息等；</p>
            <p class="blackLittleText">（2）没有得到许可，企图探查、扫描或测试系统或网络的弱点或者破坏安全措施；</p>
            <p class="blackLittleText">（3）企图干涉对用户及网络的服务，包括但不限于通过超载、“邮件炸弹”或“摧毁”等手段；</p>
            <p class="blackLittleText">（4）发送促销、产品广告及服务的email；</p>
            <p class="blackLittleText">（5）伪造TCP/IP数据包名称或部分名称。破坏系统或网络可能导致犯罪。暹罗点餐将调查此类破坏行为的发生，并可能干预、和执法当局合作起诉犯此类破坏行为的使用者。</p>
            <p class="blackLittleText">3、总则</p>
            <p class="blackLittleText">严禁从事以下行为：</p>
            <p class="blackLittleText">（1）开展违反任何现行法律法规及其他规范性文件的任何活动；</p>
            <p class="blackLittleText">（2）侵犯他人的版权、商业机密、或其他知识产权，或侵犯了他人的隐私权、出版权或其他个人合法权利；</p>
            <p class="blackLittleText">（3）利用本网站传送、分发、储存违反任何法律法规及其他规范性文件的内容，包括但不限于属于诽谤、淫秽、威胁、辱骂性、毁损他人或其他非法或者违反社会公序良俗的材料；</p>
            <p class="blackLittleText">（4）利用本网站提供的服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；</p>
            <p class="blackLittleText">（5）以任何形式使用本网站提供的服务进行任何不利于本网站的行为。</p>
      

            <h3 class="littleTitle">（九）服务暂停、服务终止</h3>
            <p class="blackLittleText">任何一位使用者经暹罗点餐确定已违反了有关法律法规、本协议或网站使用规则某一项规定，将收到一份书面警告。如果该使用者在接到前述警告后，以书面形式表示自己再也不会有违犯行为，暹罗点餐有权决定是否继续给予暂停或终止使用的处理。然而，如果本网站认为必要时，也可不提出警告而马上暂停或终止对该使用者的服务。如果我们确定某一使用者再次违犯了网络使用规则的任何一项规定，无需再发通知，该使用者立即受到暂停使用或终止使用的处理。</p>

            <h3 class="littleTitle">（十）法律适用和争议处理</h3>
            <p class="blackLittleText">本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律法规。如用户就本协议与本网站及暹罗点餐发生任何争议，应提交暹罗点餐所在地有管辖权的人民法院进行诉讼。</p>

            <h2 class="blackTitle">二、法律声明</h2>
             <h3 class="littleTitle">（一）版权</h3>
            <p class="blackLittleText">此网站的内容、图表、版式设计等所呈现出的全部或部分可单独作为作品保护之内容等及维系本网站运营的各种源代码、执行程序、系统均受到中国版权法律、法规及相关国际条约的保护。暹罗点餐对上述内容拥有一切权利，未经暹罗点餐同意，不允许全部或部分复制、转载或以其他任何方式使用。禁止以任何目的重新使用暹罗点餐网上的内容和图表等作品或作品元素。在事先得到暹罗点餐许可，且未对内容和图表等作品、元素进行任何修改的情况下，暹罗点餐的网上材料可作为网外信息方面和非商业方面的用途。经暹罗点餐同意后复制、转载或者以其他形式使用本网站相关资料的，应当标明资料来源于“暹罗点餐”，以及暹罗点餐或相关第三方拥有该等资料的著作权的字样。</p>
      
             <h3 class="littleTitle">（二）免责条款</h3>
            <p class="blackLittleText">1、使用者理解并同意暹罗点餐对以下情况免责：</p>
            <p class="blackLittleText">（2）暹罗点餐并不能时时监视此网址，但保留进行随时监视的权利。对于非暹罗点餐公布的材料，暹罗点餐一概不负任何责任；</p>
            <p class="blackLittleText">（3）暹罗点餐虽然对用户进行资质审查，但暹罗点餐并非司法机关，仅能要求用户提交真实、有效的资质证明文件，并对该提交的资质证明文件进行审核。如用户提交虚假、伪造、变造文件的，暹罗点餐对此概不承担法律责任；</p>
            <p class="blackLittleText">（4）暹罗点餐不对用户的线下行为负责。商家及个人用户均应审慎的对待他方之行为，因为他方之行为给用户造成任何不利影响的，暹罗点餐不承担任何法律责任；</p>
            <p class="blackLittleText">（5）为了更好的提升餐饮服务效果暹罗点餐可能会将您的餐饮服务信息与我们的关联方共享。但我们只会共享必要的信息，且受本协议中所声明目的的约束。暹罗点餐不能保证某一种职位描述会有一定数目的使用者来浏览，也不能保证会有一位特定的使用者来浏览；</p>
            <p class="blackLittleText">（6）暹罗点餐对由于政府禁令、现行生效的适用法律或法规的变更、火灾、地震、动乱、战争、停电、通讯线路中断、黑客攻击、计算机病毒侵入或发作、电信部门技术调整、因政府管制而造成网站的暂时性关闭等任何影响网络正常运营的不可预见、不可避免、不可克服和不可控制的事件（“不可抗力事件”），以及他人蓄意破坏、暹罗点餐工作人员的疏忽或不当使用，正常的系统维护、系统升级，或者因网络拥塞而导致暹罗点餐不能访问而造成的暹罗点餐所提供的信息及数据的延误、停滞或错误，以及使用者由此受到的一切损失不承担任何责任；</p>
            <p class="blackLittleText">（7）由于与暹罗点餐链接的其他网站或用户所使用的网络运营商所造成之个人资料泄露及由此而导致的任何法律争议和后果均由网站或用户所使用的网络运营商负责；</p>
            <p class="blackLittleText">（8）对于暹罗点餐为使用者提供便利而设置的外部链接网址，暹罗点餐并不保证其准确性、安全性和完整性，亦并不代表本网站对其链接内容的认可，请使用者谨慎确认后使用，暹罗点餐对由此导致的任何损失或伤害不承担任何责任。</p>
            <p class="blackLittleText">2、除了本网址在隐私政策中提出的条款外，使用者理解并同意暹罗点餐在不公开用户公司名称/用户个人姓名的情况下，可以向第三方提供综合性的非个人化信息资料。除非：</p>
            <p class="blackLittleText">（1）依照法律、法规、法院命令、监管机构命令的要求；</p>
             <p class="blackLittleText">（2）根据政府行为、监管要求或请求；</p>
            <p class="blackLittleText">（3）因暹罗点餐其认为系为遵守监管义务或公共目的所需；</p>
            <p class="blackLittleText">（4）为免除访问者在生命、身体或财产方面之急迫危险，</p>
            <p class="blackLittleText">否则在未经用户事先同意的情况下，暹罗点餐不会向第三方公开用户的公司名称/姓名、地址、电子邮件和电话等个人信息。</p>

             <h3 class="littleTitle">（三）隐私政策</h3>
             <p class="blackLittleText">1、有关使用者的个人化信息</p>
             <p class="blackLittleText">我们会收集使用者的个人化信息，主要包括：（1）个人基本信息（包括但不限于姓名、性别、出生年月日、手机号码、个人邮箱、工作经验、工作年限、期望职业、期望工作地区等）；（2）使用者的使用偏好信息（包括但不限于用于登录的第三方关联账号相关信息，使用者所使用的设备相关信息）；（3）使用者的使用记录信息（包括但不限于使用者使用暹罗点餐服务所产生的设备信息、浏览信息、点击信息、日志信息、cookies等）。</p>
             <p class="blackLittleText">我们收集的使用者的个人化信息仅用于提供、优化、改善我们的餐饮服务服务（即个人职业和）。我们收集、使用个人化信息仅限于必要范围，常见的场景包括：当使用者注册为暹罗点餐的用户时，暹罗点餐会收集使用者输入的手机号码，用于标识使用者为暹罗点餐的用户；暹罗点餐可能通过使用者提供的联系方式与使用者通信，包括通知使用者有关账户、安全性更新、产品和服务信息，及推荐可能感兴趣的内容。</p>
             <p class="blackLittleText">我们会在征得使用者的同意后，获取使用者的通讯录信息用于计算使用者的人脉信息，为使用者提供包括人脉印象、人脉分布、技能评价和邀请好友进行内推以提高获取目标职位的成功率等用途。拒绝提供该信息不影响正常使用暹罗点餐的其他功能，使用者可以随时关闭通讯录信息授权。</p>
             <p class="blackLittleText">我们会在征得使用者的同意后，记录使用者的地理位置信息，用于匹配企业餐饮服务职位的地理位置信息以为使用者推荐附近的职位信息。拒绝提供该信息不影响正常使用暹罗点餐的其他功能，使用者可以随时关闭你的地理位置信息授权。</p>
             <p class="blackLittleText">在使用暹罗点餐提供的服务时，请使用者不要主动向暹罗点餐提供除接受服务外需要提供的其他个人敏感信息（如种族、宗教、政治立场等），该等信息有被暹罗点餐意外收集的可能性。</p>
             <p class="blackLittleText">2、公开信息的例外情形</p>
             <p class="blackLittleText">除上述条款规定的情形外，我们不会公开暹罗点餐及相关主体收集的任何信息，除非：（1）事先获得使用者的同意或授权；（2）依照法律、法规、法院命令、监管机构命令的要求，或根据政府行为、监管要求或请求，或因暹罗点餐其认为系为遵守监管义务所需时；（3）为免除使用者在生命、身体或财产方面的紧急危险；（4）只有共享使用者的信息，才能提供使用者需要的服务（包括但不限于关联方及业务合作伙伴提供的产品），或处理使用者与他人的纠纷或争议；（5）符合与用户签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；（6）为完成合并、分立、收购或资产转让；（7）维护暹罗点餐、暹罗点餐的关联方或合作伙伴的合法权益；（8）基于符合法律法规的社会公共利益而使用。</p>
             <p class="blackLittleText">如果使用者把个人资料输入我们和我们的业务合作伙伴们共同策划的网页上，例如暹罗点餐和伙伴公司共同策划的活动页面，则使用者可能被要求授权我们的业务合作伙伴使用特定数据。如果使用者同意向业务合作伙伴授权，暹罗点餐对业务合作伙伴公司获得该个人信息及之后个人信息的使用不承担任何法律责任。</p>
             <p class="blackLittleText">如上述条款所规定，暹罗点餐可能会将经过特定处理的使用者的个人信息与我们的关联方、业务合作伙伴共享。但我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。</p>
             <p class="blackLittleText">使用者请谨慎考虑通过我们的服务上传、发布和交流的信息内容。在一些情况下，使用者可通过我们某些服务的隐私设定来控制有权浏览共享信息的用户范围。</p>
             <p class="blackLittleText">4、信息使用和存储</p>
             <p class="blackLittleText">我们向使用者收集的信息，主要用于向使用者提供各项服务，并维护、改进这些服务。</p>
             <p class="blackLittleText">暹罗点餐收集的有关使用者的信息和资料将保存在暹罗点餐及（或）其关联公司的服务器上，这些信息和资料可能传送至使用者所在国家、地区或暹罗点餐收集信息和资料所在地并在该地被访问、存储和展示。</p>
             <p class="blackLittleText">在使用者的帐号活跃期间或需要向使用者提供"服务"的情况下，暹罗点餐都将保留使用者提供的个人数据。即使使用者只是隔几年才使用我们的"服务"新工作，我们仍将保留使用者的信息并让使用者的职业档案处于使用中，直到使用者注销帐号为止。在某些情况下，我们会选择以不可识别个人或整合的形式保留某些信息。</p>
             <p class="blackLittleText">5、个人信息保护</p>
             <p class="blackLittleText">使用者的账户均有安全保护功能，请妥善保管个人的账户及密码信息。暹罗点餐将通过向其它服务器备份、对用户密码进行加密等安全措施确保使用者的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请使用者理解，由于技术的限制以及可能存在的各种恶意手段，即便竭尽所能加强安全措施，在信息网络上也不存在"完善的安全措施"。如因使用者自己的原因导致账户及密码信息泄露而造成的任何法律后果需由使用者本人负责。</p>
             <p class="blackLittleText">在使用暹罗点餐服务进行网上交易时，如不可避免地要向交易对方或潜在的交易对方披露自己的个人信息（例如联系人、联络方式等），请使用者妥善保护自己的个人信息，仅在必要的情形下向他人提供。如发现自己的个人信息已经被泄露或者存在被泄露的可能，且有可能会危及使用者注册获得的暹罗点餐账户安全，或者给使用者造成其他的损失的，请务必在第一时间通知暹罗点餐客服，以便暹罗点餐采取相应措施维护使用者的账户安全，防止损失的发生或者进一步扩大。为避免疑义，如果使用者未在第一时间通知暹罗点餐客服，则应自行承担由此给使用者造成的损失（及扩大的损失）。</p>
             
             <h3 class="littleTitle">（四）风险声明</h3>
             <p class="blackLittleText">使用者使用本网址须自行承担风险。本网址的材料是按“正如… …的情况”所提供的，对材料不作任何明示的或暗示的保证。除非适用的法律法规有明确规定，暹罗点餐及其所属网络对销售性的和适合于某一特定目的的一切保证不予承认。暹罗点餐不能保证材料的特殊目的不受阻挠不出错误，也不能保证错误会得到纠正，也不能保证本网址或制成本网址的材料不含有病毒或其他有害成分。在有关材料的使用或使用结果方面对材料的正确性、准确性、可靠性或其他方面，暹罗点餐 不作出保证或任何说明。用户（而不是暹罗点餐）承担一切必要的服务、修理或改正费用。在适用法规不允许暗含保证可免除承担一切费用的范围里，免除上述承担费用不适用于使用者。</p>
              <el-button class="returnBtn" type="primary" @click.native.prevent="$router.push('/register')">返回</el-button>
      </div>
    </section>
  
  
</template>

<script>
  export default {
    data() {
      return {
       
      };
    },
   
    methods: {

    }
   
  }

</script>

<style lang="scss" scoped>
.box{
  padding-left: 6px;
  padding-right: 6px;
  .blackTitle{
   text-align: center;
   font-weight: bold;
   margin-top: 10px;
 }
 .blackText{
   font-size: 16px;
   margin-top: 30px;
 }
 .littleTitle{
   text-align: left;
   font-weight: bold;
   margin-top: 20px;
   margin-bottom: 20px;
 }
 .blackLittleText{
   font-size: 16px;
 }
 .returnBtn{
   display: block;
   margin: 0 auto;
   margin-top: 40px;
   margin-bottom: 40px;
 }
}
 
</style>